In [1]:
# importações
import pandas as pd
import psycopg2

In [ ]:
# importando planilha
#tabela = pd.read_csv(r'C:\projetos\prospeccao-de-clientes\dados\empresas.csv')
tabela_teste = pd.read_csv(r'C:\projetos\prospeccao-de-clientes\dados\teste.csv')

In [3]:
#tabela.head()
tabela_teste.head()

       nome        cargo          data
0   Peixoto  Programador    2025-04-28
1  Leopoldo     Analista    2025-04-28
2   Lucinda     Analista    2025-04-28
3      Juca      Gerente    2025-04-20

In [37]:
# Criar banco de dados 

# conectando ao banco de dados
conexao = psycopg2.connect(
    dbname ='empresas_cadastradas',
    user='postgres',
    password='TESte1234@',
    port='5432'
)

In [ ]:
# criando o cursor
cursor = conexao.cursor()

nome = input('Nome: ')
cargo = input('Cargo: ')
datacontratacao = input('Data (AAAA-MM-DD): ')

# inserindo os dados do funcionario no banco de dados
cursor.execute("INSERT INTO Funcionarios (nome, cargo, datacontratacao) VALUES (%s, %s, %s)",
(nome, cargo, datacontratacao))

conexao.commit()

cursor.close()
conexao.close()

In [ ]:
# criando o cursor
cursor = conexao.cursor()

# inserir os dados
for linha in tabela_teste.values:
    nome, cargo, data = linha
    cursor.execute(
        "INSERT INTO Funcionarios (nome, cargo, datacontratacao) VALUES (%s, %s, %s)",
        (nome, cargo, data)
    )

conexao.commit()

cursor.close()
conexao.close()

In [ ]:
# criando o cursor
cursor = conexao.cursor()

# inserir os dados
for registro in tabela.values:
    id, razao_social, nome_fantasia, cnpj, cnae_principal, endereco, cidade, estado, pais, email, telefone, situacao_cadastral = registro
    cursor.execute(
        "INSERT INTO empresas (id, razao_social, nome_fantasia, cnpj, cnae_principal, endereco, cidade, estado, pais, email, telefone, situacao_cadastral) VALUES (%s, %s, %s)",
        (nome, cargo, data)
    )

conexao.commit()

In [38]:
# consultando a tabela

# criando o cursor
cursor = conexao.cursor()

df = pd.read_sql_query('SELECT * FROM funcionarios', con =conexao)
df

C:\Users\Carlos\AppData\Local\Temp\ipykernel_7808\3204900335.py:6: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df = pd.read_sql_query('SELECT * FROM funcionarios', con =conexao)

   id      nome               cargo datacontratacao
0   1    Carlos  Cientista de Dados      2025-04-28
1   6   Peixoto         Programador      2025-04-28
2   7  Leopoldo            Analista      2025-04-28
3   8   Lucinda            Analista      2025-04-28
4   9      Juca             Gerente      2025-04-20